app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      @artist_inst = Artist.find_by(id: params[:artist_id])
      if @artist_inst.nil?
        flash[:notice] = "No such artist!"
        redirect_to artists_path
      else
        @song = @artist_inst.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 10], ["id", 19]]

  def update
    @song = Song.find(params[:id])

    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 9], ["updated_at", "2016-09-02 03:23:15.874915"], ["id", 19]]